## Python-SQL
    Retrieving dataset from mySQL

In [1]:
%pip install sqlalchemy ipython-sql

Requirement already satisfied: sqlalchemy in c:\advance python\repository\venv\lib\site-packages (2.0.40)
Requirement already satisfied: ipython-sql in c:\advance python\repository\venv\lib\site-packages (0.5.0)
Requirement already satisfied: greenlet>=1 in c:\advance python\repository\venv\lib\site-packages (from sqlalchemy) (3.1.1)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\advance python\repository\venv\lib\site-packages (from sqlalchemy) (4.12.2)
Requirement already satisfied: prettytable in c:\advance python\repository\venv\lib\site-packages (from ipython-sql) (3.16.0)
Requirement already satisfied: ipython in c:\advance python\repository\venv\lib\site-packages (from ipython-sql) (8.32.0)
Requirement already satisfied: sqlparse in c:\advance python\repository\venv\lib\site-packages (from ipython-sql) (0.5.3)
Requirement already satisfied: six in c:\advance python\repository\venv\lib\site-packages (from ipython-sql) (1.17.0)
Requirement already satisfied: ipython-genutils in c:\advance python\repository\venv\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: colorama in c:\advance python\repository\venv\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: decorator in c:\advance python\repository\venv\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\advance python\repository\venv\lib\site-packages (from ipython->ipython-sql) (0.19.2)
Requirement already satisfied: matplotlib-inline in c:\advance python\repository\venv\lib\site-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: prompt_toolkit<3.1.0,>=3.0.41 in c:\advance python\repository\venv\lib\site-packages (from ipython->ipython-sql) (3.0.50)
Requirement already satisfied: pygments>=2.4.0 in c:\advance python\repository\venv\lib\site-packages (from ipython->ipython-sql) (2.19.1)
Requirement already satisfied: stack_data in c:\advance python\repository\venv\lib\site-packages (from ipython->ipython-sql) (0.6.3)
Requirement already satisfied: traitlets>=5.13.0 in c:\advance python\repository\venv\lib\site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: wcwidth in c:\advance python\repository\venv\lib\site-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.4 in c:\advance python\repository\venv\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: executing>=1.2.0 in c:\advance python\repository\venv\lib\site-packages (from stack_data->ipython->ipython-sql) (2.2.0)
Requirement already satisfied: asttokens>=2.1.0 in c:\advance python\repository\venv\lib\site-packages (from stack_data->ipython->ipython-sql) (3.0.0)
Requirement already satisfied: pure-eval in c:\advance python\repository\venv\lib\site-packages (from stack_data->ipython->ipython-sql) (0.2.3)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.0 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
%pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\advance python\repository\venv\lib\site-packages (9.2.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.0 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
%pip install PyMySQL

Requirement already satisfied: PyMySQL in c:\advance python\repository\venv\lib\site-packages (1.1.1)Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.0 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [4]:
from sqlalchemy import URL,create_engine

In [5]:
import pandas as pd

In [6]:
conn_str=URL.create(
   drivername="mysql+pymysql",
    username="root",
    password="root",
    host = "localhost",
    port = 3306,
    database="table1" 
)

In [12]:
engine=create_engine(conn_str)

In [13]:
conn=engine.connect()
# to view all the tables present in table1 database
pd.read_sql("show tables",conn)

   Tables_in_table1
0          athletes
1       course_data
2           courses
3         customers
4        department
5              dept
6            dept_2
7            dept_3
8            drinks
9              emp3
10            emp_2
11          empdata
12         empdata1
13         employee
14            marks
15           snacks
16          startup
17             tips
18            users
19           users2

In [14]:
# retrieve all the columns from users table
df = pd.read_sql("select * from users",conn)
df

   id         username  age          email_id      mob gender
0   1            raman   28       raman@gmail  7890654   None
1   1  baman@gmail.com   28             baman  7890654   None
2   1            baman   28   baman@gmail.com  7890654   None
3   2            suman   34   suman@gmail.com   987665   None
4   3           Thaman   45  Thaman@gmail.com  9876456   None
5   4            Naman   35   Naman@gmail.com  9875457   None
6   5           Varman   27  Varman@gmail.com   786546   None

In [17]:
# retrieve name,email from users table
df1 = pd.read_sql("select age,email_id from users",conn)
df1

   age          email_id
0   28       raman@gmail
1   28             baman
2   28   baman@gmail.com
3   34   suman@gmail.com
4   45  Thaman@gmail.com
5   35   Naman@gmail.com
6   27  Varman@gmail.com

In [18]:
# to push the datasets to mysql
df1.to_sql("users_new_py",conn,if_exists='replace')

7